In [7]:
import pandas as pd
import numpy as np
from matplotlib import pyplot as plt
%matplotlib inline
import matplotlib
matplotlib.rcParams["figure.figsize"]=(20,10)

In [13]:
data_frame=pd.read_csv(".//data//Bengaluru_House_Data.csv")
data_frame.head()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00

In [15]:
data_frame.shape

(13320, 9)

In [17]:
#Grouping data based on area

data_frame.groupby('area_type')['area_type'].agg('count')

area_type
Built-up  Area          2418
Carpet  Area              87
Plot  Area              2025
Super built-up  Area    8790
Name: area_type, dtype: int64

In [21]:
data_frame.columns

Index(['area_type', 'availability', 'location', 'size', 'society',
       'total_sqft', 'bath', 'balcony', 'price'],
      dtype='object')

In [25]:
#Data cleaning
"""
In data cleaning most basic part is to handle null value. So first of all we will find
null values in all the columns and then we will replace it with some numeric data(like we
can taken median of all value and fill it with them) or we can drop them as well and for
non-numeric data either we can drop them or we can fill thwm with most common data which is
avilable in that column i.e. 
"""
#fetching all the null values in each columns
data_frame.isnull().sum()

area_type          0
availability       0
location           1
size              16
society         5502
total_sqft         0
bath              73
balcony          609
price              0
dtype: int64

In [29]:
data_frame['bath'] = data_frame['bath'].fillna(data_frame['bath'].median())
data_frame['balcony'] = data_frame['balcony'].fillna(data_frame['balcony'].median())

In [31]:
data_frame.isnull().sum()

area_type          0
availability       0
location           1
size              16
society         5502
total_sqft         0
bath               0
balcony            0
price              0
dtype: int64

In [37]:
"""
For non-numeric data we are finding the list of most used value and then we are replacing 
value at 0 index with 
"""
data_frame['location'] = data_frame['location'].fillna(data_frame['location'].mode()[0])
data_frame['society'] = data_frame['society'].fillna(data_frame['society'].mode()[0])
data_frame['size'] = data_frame['size'].fillna(data_frame['size'].mode()[0])

In [39]:
data_frame.isnull().sum()

area_type       0
availability    0
location        0
size            0
society         0
total_sqft      0
bath            0
balcony         0
price           0
dtype: int64

In [41]:
data_frame['size'].unique() 
"""

"""

array(['2 BHK', '4 Bedroom', '3 BHK', '4 BHK', '6 Bedroom', '3 Bedroom',
       '1 BHK', '1 RK', '1 Bedroom', '8 Bedroom', '2 Bedroom',
       '7 Bedroom', '5 BHK', '7 BHK', '6 BHK', '5 Bedroom', '11 BHK',
       '9 BHK', '9 Bedroom', '27 BHK', '10 Bedroom', '11 Bedroom',
       '10 BHK', '19 BHK', '16 BHK', '43 Bedroom', '14 BHK', '8 BHK',
       '12 Bedroom', '13 BHK', '18 Bedroom'], dtype=object)